## 정렬 sort

- 데이터 정렬
- 기준
    - 인덱스 = sort_index()
    - 값 => sort_value()

In [1]:
import pandas as pd
import numpy as np                       # nan 사용

# 데이터 생성
df = pd.DataFrame({'value':[4, 1, 2, 3, 5],
                   'name' :['Jhon Kim', 'GilDong Hong', 'Tom', 'Lee', 'Annan Jung'],
                   'age'  :[12, np.nan, 10, 6, np.nan]})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [2]:
# 인덱스 & 컬럼 확인
print(df.index, df.columns, sep='\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [4]:
# 정렬하기
df.sort_index(ascending=False)

   value          name   age
4      5    Annan Jung   NaN
3      3           Lee   6.0
2      2           Tom  10.0
1      1  GilDong Hong   NaN
0      4      Jhon Kim  12.0

In [6]:
# 특정 컬럼 기준 정렬 => sort_value()
# name  컬럼으로 정렬
df.sort_values(by='name')

   value          name   age
4      5    Annan Jung   NaN
1      1  GilDong Hong   NaN
0      4      Jhon Kim  12.0
3      3           Lee   6.0
2      2           Tom  10.0

In [8]:
df.name[0], len(df.name[0])

('Jhon Kim', 8)

In [12]:
nameLength = [len(name) for name in df['name']]

In [13]:
df['nameLength'] = nameLength

In [15]:
df.sort_values('nameLength', ascending=False)

   value          name   age  nameLength
1      1  GilDong Hong   NaN          12
4      5    Annan Jung   NaN          10
0      4      Jhon Kim  12.0           8
2      2           Tom  10.0           3
3      3           Lee   6.0           3

In [ ]:
# name len으로 정렬 방법(2)
df.sort_values(by='name', )

# 컬럼명 정렬 -------------------------------------------------------------------

In [17]:
df.columns, type(df.columns), list(df.columns)

(Index(['value', 'name', 'age', 'nameLength'], dtype='object'),
 pandas.core.indexes.base.Index,
 ['value', 'name', 'age', 'nameLength'])

In [18]:
colList = list(df.columns)
colList.sort()

In [19]:
colList

['age', 'name', 'nameLength', 'value']

In [20]:
df2 = df[colList]
df2

    age          name  nameLength  value
0  12.0      Jhon Kim           8      4
1   NaN  GilDong Hong          12      1
2  10.0           Tom           3      2
3   6.0           Lee           3      3
4   NaN    Annan Jung          10      5

0  age                   12.0
   name              Jhon Kim
   nameLength               8
   value                    4
1  name          GilDong Hong
   nameLength              12
   value                    1
2  age                   10.0
   name                   Tom
   nameLength               3
   value                    2
3  age                    6.0
   name                   Lee
   nameLength               3
   value                    3
4  name            Annan Jung
   nameLength              10
   value                    5
dtype: object